app/Http/Controllers/Admin/ChuDeController.php

select * from `ChuDe` order by `id` desc
---
    public function search(Request $request)
    {
        $tukhoa = $request->get('tukhoa');
        $loai = $request->get('loai');
        $chude = ChuDe::where('id', '>', 0);
        if($loai != -1)
        {
           $chude = $chude->where('duan', $loai);
        }
        if (!empty($tukhoa)) {
            $chude = $chude->where('tenchude', 'like', '%'.$tukhoa.'%');
            # code...
        }
        return response(json_encode($chude->orderBy('id', 'desc')->get()));

select * from `ChuDe` order by `id` desc
---
    public function index()
    {
        $dschude6 = ChuDe::orderBy('id', 'desc')->get();

select * from `ChuDe` order by `id` desc
---
    public function reload()
    {
        $dschude = ChuDe::orderBy('id', 'desc')->get();

select * from `ChuDe` where `ChuDe`.`id` is null limit 1
---
    public function show($id)
    {
        $chude = ChuDe::find($id);

select * from `ChuDe` where `ChuDe`.`id` = '37' limit 1
---
    public function update(Request $request)
    {
         $mss = new Message(true, 'Cập nhật chủ đề thành công');
        if($request->ajax())
        {
            $id = $request->get('id');
            $chude = ChuDe::find($id);

select * from `ChuDe` where `id` in ('38')
delete from `ChuDe` where `id` = '38'
---
    public function destroy($id)
    {
        $chude = Chude::find($id);
        Chude::destroy($id);